app/controllers/admins_controller.rb

INSERT INTO "admins" ("name", "email", "password_digest", "created_at", "updated_at", "is_superadmin") VALUES (?, ?, ?, ?, ?, ?)  [["name", "john"], ["email", "john@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-07 13:47:20.946741"], ["updated_at", "2023-08-07 13:47:20.946741"], ["is_superadmin", 0]]
---
    def create
      @admin= Admin.new(admin_params)

      if @admin.save