app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO "customers" ("name", "email", "password_digest", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "john"], ["email", "john@gmail.com"], ["password_digest", "[FILTERED]"], ["admin_id", 8], ["created_at", "2023-08-07 13:34:23.567042"], ["updated_at", "2023-08-07 13:34:23.567042"]]