app/controllers/drivers_controller.rb

  def create
    @driver = Driver.new(driver_params)

    if @driver.save
---
INSERT INTO "drivers" ("name", "email", "password_digest", "admin_id", "created_at", "updated_at", "registration_number", "route") VALUES (?, ?, ?, ?, ?, ?, ?, ?)