app/models/booking.rb

  def seat_number_uniqueness_for_bus
    return unless bus

    if bus.bookings.where(seat_number: seat_number).exists?
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."bus_id" = ? AND "bookings"."seat_number" = ? LIMIT ?  [["bus_id", 1], ["seat_number", 1], ["LIMIT", 1]]